app/controllers/activities_controller.rb

SELECT * FROM `activities`
---
  def index
    @activities = Activity.all

SELECT * FROM `activities` WHERE (`activities`.`id` = 1)
---
  def show
    @activity = Activity.find(params[:id])

SELECT * FROM "activities" WHERE ("activities"."id" = 1)
---
  def edit
    @activity = Activity.find(params[:id])

INSERT INTO `activities` (`created_at`, `title`, `delivery_date`, `updated_at`, `specification`, `group_id`) VALUES('2010-11-23 03:09:13', 'Relogio', '2008-02-23', '2010-11-23 03:09:13', 'Especificação do Relogio', 1)
SELECT * FROM "groups" WHERE ("groups"."id" = 1)
SELECT * FROM "teachers" WHERE ("teachers"."id" = 1)
SELECT * FROM "students" INNER JOIN "students_groups" ON "students".id = "students_groups".student_id WHERE ("students_groups".group_id = 1 ) LIMIT 1
---
  def create
    @activity = Activity.new(params[:activity])
    # O id da turma que estava como hidden no formulario
    # é adicionado a atividade criada
    @activity.group_id = params[:group_id]

    respond_to do |format|
      if @activity.save
        flash[:notice] = 'Activity was successfully created.'
        format.html { redirect_to(@activity) }
        format.xml  { render :xml => @activity, :status => :created, :location => @activity }

        #Also, generate a notification to send to the students enrolled in the group that the activity was created

        @teacher = @activity.group.teacher
        @student = @activity.group.students.first

SELECT * FROM "activities" WHERE ("activities"."id" = 1)
UPDATE "activities" SET "updated_at" = '2010-12-04 02:56:34', "specification" = 'aula para acabar os assuntos da disciplina.' WHERE "id" = 6
---
  def update
    @activity = Activity.find(params[:id])

    respond_to do |format|
      if @activity.update_attributes(params[:activity])

SELECT * FROM "activities" WHERE ("activities"."id" = 1)
DELETE FROM "activities" WHERE "id" = 1
---
  def destroy
    @activity = Activity.find(params[:id])
    @activity.destroy