app/controllers/courses_controller.rb

  def index
    @courses = Course.all
---
SELECT * FROM `courses`

  def show
    @course = Course.find(params[:id])
---
SELECT * FROM `courses` WHERE (`courses`.`id` = 1)

  def edit
    @course = Course.find(params[:id])
---
SELECT * FROM `courses` WHERE (`courses`.`id` = 2)

  def create
    @course = Course.new(params[:course])

    respond_to do |format|
      if @course.save
---
INSERT INTO `courses` (`name`, `created_at`, `code`, `updated_at`) VALUES('Engenharia de Software', '2010-11-23 02:39:28', 'MATA68', '2010-11-23 02:39:28')

  def update
    @course = Course.find(params[:id])
---
SELECT * FROM "courses" WHERE ("courses"."id" = 1)

  def destroy
    @course = Course.find(params[:id])
    @course.destroy
---
SELECT * FROM "courses" WHERE ("courses"."id" = 980190962)
DELETE FROM "courses" WHERE "id" = 980190962