app/controllers/cpd_controller.rb

SELECT * FROM "students" WHERE ("students"."id" = 1)
---
  def add_to_group
    @student = Student.find(params[:id])

SELECT * FROM "students" WHERE ("students"."id" = 1)
SELECT * FROM "groups" WHERE ("groups"."id" = 2)
---
  def add_group
    error = false
    messege = "Student successfully added to group"
    student = Student.find(params[:id])
    begin
      group = Group.find(params[:group_id])