app/controllers/groups_controller.rb

SELECT * FROM `courses`
SELECT * FROM `teachers`
---
  def new
    @group = Group.new
    @courses = Course.all
    @teachers = Teacher.all