app/controllers/groups_controller.rb

SELECT * FROM `groups`
---
  def index
    @groups = Group.all

SELECT * FROM `groups` WHERE (`groups`.`id` = 1)
---
  def show
    @group = Group.find(params[:id])

SELECT * FROM "groups" WHERE ("groups"."id" = 1)
---
  def edit
    @group = Group.find(params[:id])

SELECT * FROM "groups" WHERE ("groups"."id" = 9)
---
  def show_students
    @group = Group.find(params[:id])

SELECT * FROM "groups" WHERE ("groups"."id" = 9)
---
  def show_activities
    @group = Group.find(params[:id])

SELECT * FROM `groups` WHERE (`groups`.`id` = 1)
---
  def manage_group
    @group = Group.find(params[:id])

INSERT INTO "groups" ("number", "id_course", "created_at", "semester", "updated_at", "year", "id_teacher") VALUES(5000, NULL, '2010-11-07 15:01:06', 1, '2010-11-07 15:01:06', 2009, NULL)
---
  def create
    @group = Group.new(params[:group])

    respond_to do |format|
      if @group.save

SELECT * FROM "groups" WHERE ("groups"."id" = 1)
UPDATE "groups" SET "updated_at" = '2010-12-04 02:47:44', "semester" = 1 WHERE "id" = 1
---
  def update
    @group = Group.find(params[:id])

    respond_to do |format|
      if @group.update_attributes(params[:group])

SELECT * FROM "groups" WHERE ("groups"."id" = 1)
DELETE FROM "groups" WHERE "id" = 1
---
  def destroy
    @group = Group.find(params[:id])
    @group.destroy