app/controllers/students_controller.rb

SELECT * FROM "students"
---
  def list
    @students = Student.all