app/controllers/students_controller.rb

SELECT * FROM `students`
---
  def index
    @students = Student.all

SELECT * FROM `students` WHERE (`students`.`id` = 1)
SELECT * FROM `groups`
---
  def show
    @student = Student.find(params[:id])
    @groups = Group.all

SELECT * FROM `students` WHERE (`students`.`id` = 980190962)
---
  def edit
    @student = Student.find(params[:id])

SELECT * FROM `students` WHERE (`students`.`id` = 2)
---
  def show_groups
    @student = Student.find(params[:id])

SELECT * FROM `students` WHERE (`students`.`id` = 1)
SELECT * FROM `groups` WHERE (`groups`.`id` = 1)
SELECT * FROM `activities` WHERE (`activities`.group_id = 1)
SELECT * FROM "submissions" WHERE ("submissions"."student_id" = 1 AND "submissions"."activity_id" = 1)
---
  def show_activities
    @student = Student.find(params[:id])
    @group = Group.find(params[:group_id])

    submission_status = []
    @group.activities.each do |a|
      # Procura por uma submissão desse aluno para essa atividade
      s = Submission.find(:all, :conditions => {:activity_id => a.id, :student_id => @student.id})

SELECT * FROM `students` WHERE (`students`.`id` = 1)
SELECT * FROM `groups` WHERE (`groups`.`id` = 1)
---
  def add_group
    error = false
    @messege = "Student successfully added to group"
    @student = Student.find(params[:id])
    begin
      group = Group.find(params[:group_id])

SELECT * FROM "activities" WHERE ("activities"."id" = 1)
---
  def activity_details
    @student_id = params[:id]
    @activity = Activity.find(params[:activity_id])

SELECT * FROM "activities" WHERE ("activities"."id" = '--- :activity_id
---
  def submit_file
    @student_id = params[:id]
    @activity_id = params[:activity_id]
    delivery_date = Activity.find(params[:activity_id]).delivery_date

SELECT * FROM "students" WHERE ("students"."id" = 1)
SELECT * FROM "activities" WHERE ("activities"."id" = 1)
INSERT INTO "attachments" ("name", "created_at", "extension", "updated_at", "submission_id", "path") VALUES('Nome', '2010-11-28 03:51:59', 'Zip', '2010-11-28 03:51:59', NULL, 'Caminho')
INSERT INTO "submissions" ("student_id", "created_at", "updated_at", "activity_id") VALUES(NULL, '2010-11-28 03:52:20', '2010-11-28 03:52:20', NULL)
UPDATE "submissions" SET "updated_at" = '2010-11-28 03:58:40', "activity_id" = 1 WHERE "id" = 2
---
  def submit
    student = Student.find(params[:student_id])
    activity = Activity.find(params[:activity_id])

    attach = Attachment.new(params[:attachment])
    attach.extension = attach.path.split(".").last
    attach.save

    submission = Submission.new
    submission.save

    submission.attachment = attach

    student.submissions.push(submission)

INSERT INTO `students` (`name`, `created_at`, `updated_at`, `registration`, `email`) VALUES('Carlos Andrade', '2010-11-06 19:55:09', '2010-11-06 19:55:09', 209102527, 'carlos@email.com')
---
  def create
    @student = Student.new(params[:student])

    respond_to do |format|
      if @student.save

SELECT * FROM `students` WHERE (`students`.`id` = 980190962)
UPDATE "students" SET "updated_at" = '2010-12-04 02:49:30', "registration" = 1255 WHERE "id" = 1
---
  def update
    @student = Student.find(params[:id])

    respond_to do |format|
      if @student.update_attributes(params[:student])

SELECT * FROM `students` WHERE (`students`.`id` = 1)
DELETE FROM `students` WHERE `id` = 1
---
  def destroy
    @student = Student.find(params[:id])
    @student.destroy