app/controllers/teachers_controller.rb

  def index
    @teachers = Teacher.all
---
SELECT * FROM `teachers`

  def show
    @teacher = Teacher.find(params[:id])
---
SELECT * FROM `teachers` WHERE (`teachers`.`id` = 1)

  def edit
    @teacher = Teacher.find(params[:id])
---
SELECT * FROM "teachers" WHERE ("teachers"."id" = 1)

  def create
    @teacher = Teacher.new(params[:teacher])

    respond_to do |format|
      if @teacher.save
---
INSERT INTO "teachers" ("name", "created_at", "updated_at", "registration", "email") VALUES('Christina', '2010-11-07 12:58:29', '2010-11-07 12:58:29', 123456, 'christina@ufba.br')

  def update
    @teacher = Teacher.find(params[:id])

    respond_to do |format|
      if @teacher.update_attributes(params[:teacher])
---
SELECT * FROM "teachers" WHERE ("teachers"."id" = 1)
UPDATE "teachers" SET "updated_at" = '2010-12-04 02:46:02', "registration" = 2222 WHERE "id" = 1

  def destroy
    @teacher = Teacher.find(params[:id])
    @teacher.destroy
---
SELECT * FROM "teachers" WHERE ("teachers"."id" = 1)
DELETE FROM "teachers" WHERE "id" = 1

  def show_groups
    @teacher = Teacher.find(params[:id])
---
SELECT * FROM `teachers` WHERE (`teachers`.`id` = 1)

  def manage_group
    @group = Group.find(params[:id])
---
SELECT * FROM "groups" WHERE ("groups"."id" = 1)

  def show_students
    @group = Group.find(params[:id])
---
SELECT * FROM "groups" WHERE ("groups"."id" = 1)

  def show_activities
    @group = Group.find(params[:id])
---
SELECT * FROM "groups" WHERE ("groups"."id" = 1)

  def activity_details
    @activity = Activity.find(params[:id])
---
SELECT * FROM "activities" WHERE ("activities"."id" = 1)

  def activity_submissions
    @activity = Activity.find(params[:id])
---
SELECT * FROM "activities" WHERE ("activities"."id" = 1)

  def download_submission
    @attachment = Attachment.find(params[:id])
---
SELECT * FROM "attachments" WHERE ("attachments"."id" = 2)

  def list
    @teachers = Teacher.all
---
SELECT * FROM "teachers"